zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKW40Z4/MKW40Z4_extension.h
/*******************************************************************************
 * LTC_KS - LTC Key Size Register
 ******************************************************************************/

/*!
 * @brief LTC_KS - LTC Key Size Register (RW)
 *
 * Reset value: 0x00000010U
 *
 * The Key Size Register is used to tell the crypto engine(AES) the size of the
 * key that was loaded into the Key Register. The Key Size Register must be
 * written after the key is written into the Key Register. Writing to the Key Size
 * Register will prevent the user from modifying the Key Register. Only 16 byte keys
 * are supported so this register will always read 16 bytes. This register is
 * still required to be written to indicate to the AES engine that the key was
 * loaded.
 */
/*!
 * @name Constants and macros for entire LTC_KS register
 */
/*@{*/
#define LTC_RD_KS(base)          (LTC_KS_REG(base))
#define LTC_WR_KS(base, value)   (LTC_KS_REG(base) = (value))
#define LTC_RMW_KS(base, mask, value) (LTC_WR_KS(base, (LTC_RD_KS(base) & ~(mask)) | (value)))
#define LTC_SET_KS(base, value)  (BME_OR32(&LTC_KS_REG(base), (uint32_t)(value)))
#define LTC_CLR_KS(base, value)  (BME_AND32(&LTC_KS_REG(base), (uint32_t)(~(value))))
#define LTC_TOG_KS(base, value)  (BME_XOR32(&LTC_KS_REG(base), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LTC_DS - LTC Data Size Register
 ******************************************************************************/

/*!
 * @brief LTC_DS - LTC Data Size Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The Data Size Register is used to tell the AES the amount of data that will
 * be loaded into the Input Data FIFO. This register should only be written to
 * once during a single operation. Note that writing to the , will cause this
 * register to also update. When this register is then written directory to then the
 * new value will be added to the previous value in the register. That is, if the
 * DS field currently has the value 16, writing 2 to the least-significant half of
 * the Data Size register (i.e. the DS field) will result in a value of 18 in
 * the DS field. Note that AES decrements this register, so reading the register
 * may return a value less than sum of the values that were written into it. This
 * register is cleared whenever a key is decrypted or encrypted.
 */
/*!
 * @name Constants and macros for entire LTC_DS register
 */
/*@{*/
#define LTC_RD_DS(base)          (LTC_DS_REG(base))
#define LTC_WR_DS(base, value)   (LTC_DS_REG(base) = (value))
#define LTC_RMW_DS(base, mask, value) (LTC_WR_DS(base, (LTC_RD_DS(base) & ~(mask)) | (value)))
#define LTC_SET_DS(base, value)  (BME_OR32(&LTC_DS_REG(base), (uint32_t)(value)))
#define LTC_CLR_DS(base, value)  (BME_AND32(&LTC_DS_REG(base), (uint32_t)(~(value))))
#define LTC_TOG_DS(base, value)  (BME_XOR32(&LTC_DS_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LTC_DS bitfields
 */

/*!
 * @name Register LTC_DS, field DS[11:0] (RW)
 *
 * Data Size. This is the number of whole bytes of data that will be consumed by
 * the CHA. Note that writing the AAD Size Register will result in this register
 * also being written to.
 */
/*@{*/
/*! @brief Read current value of the LTC_DS_DS field. */
#define LTC_RD_DS_DS(base)   ((LTC_DS_REG(base) & LTC_DS_DS_MASK) >> LTC_DS_DS_SHIFT)
#define LTC_BRD_DS_DS(base)  (BME_UBFX32(&LTC_DS_REG(base), LTC_DS_DS_SHIFT, LTC_DS_DS_WIDTH))

/*! @brief Set the DS field to a new value. */
#define LTC_WR_DS_DS(base, value) (LTC_RMW_DS(base, LTC_DS_DS_MASK, LTC_DS_DS(value)))
#define LTC_BWR_DS_DS(base, value) (BME_BFI32(&LTC_DS_REG(base), ((uint32_t)(value) << LTC_DS_DS_SHIFT), LTC_DS_DS_SHIFT, LTC_DS_DS_WIDTH))
/*@}*/

/*******************************************************************************
 * LTC_ICVS - LTC ICV Size Register
 ******************************************************************************/

/*!
 * @brief LTC_ICVS - LTC ICV Size Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The ICV Size Register indicates how much of the last block of ICV is valid
 * when performing AES integrity check modes (e.g. AES-CMAC, AES-XCBC-MAC). This
 * register must be written prior to the corresponding word of data being consumed
 * by AES. In practical terms, this means the register must be written prior to
 * the corresponding data being written to the Input Data FIFO.
 */
/*!
 * @name Constants and macros for entire LTC_ICVS register
 */
/*@{*/
#define LTC_RD_ICVS(base)        (LTC_ICVS_REG(base))
#define LTC_WR_ICVS(base, value) (LTC_ICVS_REG(base) = (value))
#define LTC_RMW_ICVS(base, mask, value) (LTC_WR_ICVS(base, (LTC_RD_ICVS(base) & ~(mask)) | (value)))
#define LTC_SET_ICVS(base, value) (BME_OR32(&LTC_ICVS_REG(base), (uint32_t)(value)))
#define LTC_CLR_ICVS(base, value) (BME_AND32(&LTC_ICVS_REG(base), (uint32_t)(~(value))))
#define LTC_TOG_ICVS(base, value) (BME_XOR32(&LTC_ICVS_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LTC_ICVS bitfields
 */

/*!
 * @name Register LTC_ICVS, field ICVS[4:0] (RW)
 *
 * ICV Size, in Bytes.
 */
/*@{*/
/*! @brief Read current value of the LTC_ICVS_ICVS field. */
#define LTC_RD_ICVS_ICVS(base) ((LTC_ICVS_REG(base) & LTC_ICVS_ICVS_MASK) >> LTC_ICVS_ICVS_SHIFT)
#define LTC_BRD_ICVS_ICVS(base) (BME_UBFX32(&LTC_ICVS_REG(base), LTC_ICVS_ICVS_SHIFT, LTC_ICVS_ICVS_WIDTH))

/*! @brief Set the ICVS field to a new value. */
#define LTC_WR_ICVS_ICVS(base, value) (LTC_RMW_ICVS(base, LTC_ICVS_ICVS_MASK, LTC_ICVS_ICVS(value)))
#define LTC_BWR_ICVS_ICVS(base, value) (BME_BFI32(&LTC_ICVS_REG(base), ((uint32_t)(value) << LTC_ICVS_ICVS_SHIFT), LTC_ICVS_ICVS_SHIFT, LTC_ICVS_ICVS_WIDTH))
/*@}*/

/*******************************************************************************
 * LTC_COM - LTC Command Register
 ******************************************************************************/

/*!
 * @brief LTC_COM - LTC Command Register (WO)
 *
 * Reset value: 0x00000000U
 *
 * The LTC Command Register is used to send control signals to the Crypto
 * Engines.
 */
/*!
 * @name Constants and macros for entire LTC_COM register
 */
/*@{*/
#define LTC_WR_COM(base, value)  (LTC_COM_REG(base) = (value))
/*@}*/

