zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKW40Z4/MKW40Z4_extension.h
/*******************************************************************************
 * RSIM_MAC_MSB - RSIM MAC MSB
 ******************************************************************************/

/*!
 * @brief RSIM_MAC_MSB - RSIM MAC MSB (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RSIM MAC Address registers provide a unique ID that is stored in the
 * Flash during factory test
 */
/*!
 * @name Constants and macros for entire RSIM_MAC_MSB register
 */
/*@{*/
#define RSIM_RD_MAC_MSB(base)    (RSIM_MAC_MSB_REG(base))
/*@}*/

/*
 * Constants & macros for individual RSIM_MAC_MSB bitfields
 */

/*!
 * @name Register RSIM_MAC_MSB, field MAC_ADDR_MSB[7:0] (RO)
 *
 * The RSIM MAC Address is loaded from the Flash IFR during the SoC Power on
 * Reset sequence. The MAC Address is a unique ID that is stored in the Flash during
 * factory test.
 */
/*@{*/
/*! @brief Read current value of the RSIM_MAC_MSB_MAC_ADDR_MSB field. */
#define RSIM_RD_MAC_MSB_MAC_ADDR_MSB(base) ((RSIM_MAC_MSB_REG(base) & RSIM_MAC_MSB_MAC_ADDR_MSB_MASK) >> RSIM_MAC_MSB_MAC_ADDR_MSB_SHIFT)
#define RSIM_BRD_MAC_MSB_MAC_ADDR_MSB(base) (BME_UBFX32(&RSIM_MAC_MSB_REG(base), RSIM_MAC_MSB_MAC_ADDR_MSB_SHIFT, RSIM_MAC_MSB_MAC_ADDR_MSB_WIDTH))
/*@}*/

/*******************************************************************************
 * RSIM_MAC_LSB - RSIM MAC LSB
 ******************************************************************************/

/*!
 * @brief RSIM_MAC_LSB - RSIM MAC LSB (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RSIM MAC Address registers provide a unique ID that is stored in the
 * Flash during factory test
 */
/*!
 * @name Constants and macros for entire RSIM_MAC_LSB register
 */
/*@{*/
#define RSIM_RD_MAC_LSB(base)    (RSIM_MAC_LSB_REG(base))
/*@}*/

/*******************************************************************************
 * RSIM_ANA_TEST - RSIM Analog Test
 ******************************************************************************/

/*!
 * @brief RSIM_ANA_TEST - RSIM Analog Test (RW)
 *
 * Reset value: 0x01000000U
 *
 * The RSIM Analog Test register provides controls for validation and factory
 * test of the RF Analog Circuits.
 */
/*!
 * @name Constants and macros for entire RSIM_ANA_TEST register
 */
/*@{*/
#define RSIM_RD_ANA_TEST(base)   (RSIM_ANA_TEST_REG(base))
#define RSIM_WR_ANA_TEST(base, value) (RSIM_ANA_TEST_REG(base) = (value))
#define RSIM_RMW_ANA_TEST(base, mask, value) (RSIM_WR_ANA_TEST(base, (RSIM_RD_ANA_TEST(base) & ~(mask)) | (value)))
#define RSIM_SET_ANA_TEST(base, value) (BME_OR32(&RSIM_ANA_TEST_REG(base), (uint32_t)(value)))
#define RSIM_CLR_ANA_TEST(base, value) (BME_AND32(&RSIM_ANA_TEST_REG(base), (uint32_t)(~(value))))
#define RSIM_TOG_ANA_TEST(base, value) (BME_XOR32(&RSIM_ANA_TEST_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RSIM_ANA_TEST bitfields
 */

/*!
 * @name Register RSIM_ANA_TEST, field ATST_GATE_EN[4:0] (RW)
 *
 * The RSIM Analog Transmission Gate Enables open up the transmissions gates in
 * the pads to allow testing of the Radio analog signals. Each bit opens up one
 * Analog Transmission gate in the padring.
 */
/*@{*/
/*! @brief Read current value of the RSIM_ANA_TEST_ATST_GATE_EN field. */
#define RSIM_RD_ANA_TEST_ATST_GATE_EN(base) ((RSIM_ANA_TEST_REG(base) & RSIM_ANA_TEST_ATST_GATE_EN_MASK) >> RSIM_ANA_TEST_ATST_GATE_EN_SHIFT)
#define RSIM_BRD_ANA_TEST_ATST_GATE_EN(base) (BME_UBFX32(&RSIM_ANA_TEST_REG(base), RSIM_ANA_TEST_ATST_GATE_EN_SHIFT, RSIM_ANA_TEST_ATST_GATE_EN_WIDTH))

/*! @brief Set the ATST_GATE_EN field to a new value. */
#define RSIM_WR_ANA_TEST_ATST_GATE_EN(base, value) (RSIM_RMW_ANA_TEST(base, RSIM_ANA_TEST_ATST_GATE_EN_MASK, RSIM_ANA_TEST_ATST_GATE_EN(value)))
#define RSIM_BWR_ANA_TEST_ATST_GATE_EN(base, value) (BME_BFI32(&RSIM_ANA_TEST_REG(base), ((uint32_t)(value) << RSIM_ANA_TEST_ATST_GATE_EN_SHIFT), RSIM_ANA_TEST_ATST_GATE_EN_SHIFT, RSIM_ANA_TEST_ATST_GATE_EN_WIDTH))
/*@}*/

/*!
 * @name Register RSIM_ANA_TEST, field RADIO_ID[27:24] (RO)
 *
 * This register value can be read to identify the Version of the Radio.
 *
 * Values:
 * - 0b0001 - Apache 1.0
 * - 0b0010 - Apache 2.0
 * - 0b0011 - 2.4 GHz Radio 2.0, Used by various SoC implementations
 */
/*@{*/
/*! @brief Read current value of the RSIM_ANA_TEST_RADIO_ID field. */
#define RSIM_RD_ANA_TEST_RADIO_ID(base) ((RSIM_ANA_TEST_REG(base) & RSIM_ANA_TEST_RADIO_ID_MASK) >> RSIM_ANA_TEST_RADIO_ID_SHIFT)
#define RSIM_BRD_ANA_TEST_RADIO_ID(base) (BME_UBFX32(&RSIM_ANA_TEST_REG(base), RSIM_ANA_TEST_RADIO_ID_SHIFT, RSIM_ANA_TEST_RADIO_ID_WIDTH))
/*@}*/

/*
 * MKW40Z4 RTC
 *
 * Secure Real Time Clock
 *
 * Registers defined in this header file:
 * - RTC_TSR - RTC Time Seconds Register
 * - RTC_TPR - RTC Time Prescaler Register
 * - RTC_TAR - RTC Time Alarm Register
 * - RTC_TCR - RTC Time Compensation Register
 * - RTC_CR - RTC Control Register
 * - RTC_SR - RTC Status Register
 * - RTC_LR - RTC Lock Register
 * - RTC_IER - RTC Interrupt Enable Register
 */

#define RTC_INSTANCE_COUNT (1U) /*!< Number of instances of the RTC module. */
#define RTC_IDX (0U) /*!< Instance number for RTC. */

/*******************************************************************************
 * RTC_TSR - RTC Time Seconds Register
 ******************************************************************************/

/*!
 * @brief RTC_TSR - RTC Time Seconds Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire RTC_TSR register
 */
/*@{*/
#define RTC_RD_TSR(base)         (RTC_TSR_REG(base))
#define RTC_WR_TSR(base, value)  (RTC_TSR_REG(base) = (value))
#define RTC_RMW_TSR(base, mask, value) (RTC_WR_TSR(base, (RTC_RD_TSR(base) & ~(mask)) | (value)))
#define RTC_SET_TSR(base, value) (BME_OR32(&RTC_TSR_REG(base), (uint32_t)(value)))
#define RTC_CLR_TSR(base, value) (BME_AND32(&RTC_TSR_REG(base), (uint32_t)(~(value))))
#define RTC_TOG_TSR(base, value) (BME_XOR32(&RTC_TSR_REG(base), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * RTC_TPR - RTC Time Prescaler Register
 ******************************************************************************/

/*!
 * @brief RTC_TPR - RTC Time Prescaler Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire RTC_TPR register
 */
/*@{*/
#define RTC_RD_TPR(base)         (RTC_TPR_REG(base))
#define RTC_WR_TPR(base, value)  (RTC_TPR_REG(base) = (value))
#define RTC_RMW_TPR(base, mask, value) (RTC_WR_TPR(base, (RTC_RD_TPR(base) & ~(mask)) | (value)))
#define RTC_SET_TPR(base, value) (BME_OR32(&RTC_TPR_REG(base), (uint32_t)(value)))
#define RTC_CLR_TPR(base, value) (BME_AND32(&RTC_TPR_REG(base), (uint32_t)(~(value))))
#define RTC_TOG_TPR(base, value) (BME_XOR32(&RTC_TPR_REG(base), (uint32_t)(value)))
/*@}*/

