zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKW40Z4/MKW40Z4_extension.h
/*! @brief Set the PROTOCOL field to a new value. */
#define XCVR_WR_CTRL_PROTOCOL(base, value) (XCVR_RMW_CTRL(base, XCVR_CTRL_PROTOCOL_MASK, XCVR_CTRL_PROTOCOL(value)))
#define XCVR_BWR_CTRL_PROTOCOL(base, value) (BME_BFI32(&XCVR_CTRL_REG(base), ((uint32_t)(value) << XCVR_CTRL_PROTOCOL_SHIFT), XCVR_CTRL_PROTOCOL_SHIFT, XCVR_CTRL_PROTOCOL_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_CTRL, field TGT_PWR_SRC[5:4] (RW)
 *
 * For determining transmit power, the TGT_PWR_SRC[1:0] bits control target
 * power selection, according to the following table. TGT_PWR_SRC[1:0] TARGET POWER
 * SOURCE 00 PA_POWER[3:0] register (XCVR space) 01 BTLE Link Layer 10 Zigbee Link
 * Layer (PA_PWR[3:0] register in ZIGBEE space) 11 PROTOCOL[2:0] bits select
 * target power source
 */
/*@{*/
/*! @brief Read current value of the XCVR_CTRL_TGT_PWR_SRC field. */
#define XCVR_RD_CTRL_TGT_PWR_SRC(base) ((XCVR_CTRL_REG(base) & XCVR_CTRL_TGT_PWR_SRC_MASK) >> XCVR_CTRL_TGT_PWR_SRC_SHIFT)
#define XCVR_BRD_CTRL_TGT_PWR_SRC(base) (BME_UBFX32(&XCVR_CTRL_REG(base), XCVR_CTRL_TGT_PWR_SRC_SHIFT, XCVR_CTRL_TGT_PWR_SRC_WIDTH))

/*! @brief Set the TGT_PWR_SRC field to a new value. */
#define XCVR_WR_CTRL_TGT_PWR_SRC(base, value) (XCVR_RMW_CTRL(base, XCVR_CTRL_TGT_PWR_SRC_MASK, XCVR_CTRL_TGT_PWR_SRC(value)))
#define XCVR_BWR_CTRL_TGT_PWR_SRC(base, value) (BME_BFI32(&XCVR_CTRL_REG(base), ((uint32_t)(value) << XCVR_CTRL_TGT_PWR_SRC_SHIFT), XCVR_CTRL_TGT_PWR_SRC_SHIFT, XCVR_CTRL_TGT_PWR_SRC_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_CTRL, field REF_CLK_FREQ[7:6] (RW)
 *
 * This register selects the Reference Clock Frequency for the Radio.
 *
 * Values:
 * - 0b00 - 32 MHz
 * - 0b01 - Reserved
 * - 0b10 - Reserved
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the XCVR_CTRL_REF_CLK_FREQ field. */
#define XCVR_RD_CTRL_REF_CLK_FREQ(base) ((XCVR_CTRL_REG(base) & XCVR_CTRL_REF_CLK_FREQ_MASK) >> XCVR_CTRL_REF_CLK_FREQ_SHIFT)
#define XCVR_BRD_CTRL_REF_CLK_FREQ(base) (BME_UBFX32(&XCVR_CTRL_REG(base), XCVR_CTRL_REF_CLK_FREQ_SHIFT, XCVR_CTRL_REF_CLK_FREQ_WIDTH))

/*! @brief Set the REF_CLK_FREQ field to a new value. */
#define XCVR_WR_CTRL_REF_CLK_FREQ(base, value) (XCVR_RMW_CTRL(base, XCVR_CTRL_REF_CLK_FREQ_MASK, XCVR_CTRL_REF_CLK_FREQ(value)))
#define XCVR_BWR_CTRL_REF_CLK_FREQ(base, value) (BME_BFI32(&XCVR_CTRL_REG(base), ((uint32_t)(value) << XCVR_CTRL_REF_CLK_FREQ_SHIFT), XCVR_CTRL_REF_CLK_FREQ_SHIFT, XCVR_CTRL_REF_CLK_FREQ_WIDTH))
/*@}*/

/*******************************************************************************
 * XCVR_STATUS - Transceiver Status
 ******************************************************************************/

/*!
 * @brief XCVR_STATUS - Transceiver Status (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire XCVR_STATUS register
 */
/*@{*/
#define XCVR_RD_STATUS(base)     (XCVR_STATUS_REG(base))
/*@}*/

/*
 * Constants & macros for individual XCVR_STATUS bitfields
 */

/*!
 * @name Register XCVR_STATUS, field TSM_COUNT[7:0] (RO)
 *
 * Reflects the instantaneous value of the TSM counter.
 */
/*@{*/
/*! @brief Read current value of the XCVR_STATUS_TSM_COUNT field. */
#define XCVR_RD_STATUS_TSM_COUNT(base) ((XCVR_STATUS_REG(base) & XCVR_STATUS_TSM_COUNT_MASK) >> XCVR_STATUS_TSM_COUNT_SHIFT)
#define XCVR_BRD_STATUS_TSM_COUNT(base) (BME_UBFX32(&XCVR_STATUS_REG(base), XCVR_STATUS_TSM_COUNT_SHIFT, XCVR_STATUS_TSM_COUNT_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_STATUS, field PLL_SEQ_STATE[11:8] (RO)
 *
 * Reflects the state of the PLL digital state machine.
 *
 * Values:
 * - 0b0000 - PLL OFF
 * - 0b0010 - HPMCAL2
 */
/*@{*/
/*! @brief Read current value of the XCVR_STATUS_PLL_SEQ_STATE field. */
#define XCVR_RD_STATUS_PLL_SEQ_STATE(base) ((XCVR_STATUS_REG(base) & XCVR_STATUS_PLL_SEQ_STATE_MASK) >> XCVR_STATUS_PLL_SEQ_STATE_SHIFT)
#define XCVR_BRD_STATUS_PLL_SEQ_STATE(base) (BME_UBFX32(&XCVR_STATUS_REG(base), XCVR_STATUS_PLL_SEQ_STATE_SHIFT, XCVR_STATUS_PLL_SEQ_STATE_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_STATUS, field RX_MODE[12] (RO)
 *
 * Indicates an RX transceiver operation is in progress.
 */
/*@{*/
/*! @brief Read current value of the XCVR_STATUS_RX_MODE field. */
#define XCVR_RD_STATUS_RX_MODE(base) ((XCVR_STATUS_REG(base) & XCVR_STATUS_RX_MODE_MASK) >> XCVR_STATUS_RX_MODE_SHIFT)
#define XCVR_BRD_STATUS_RX_MODE(base) (BME_UBFX32(&XCVR_STATUS_REG(base), XCVR_STATUS_RX_MODE_SHIFT, XCVR_STATUS_RX_MODE_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_STATUS, field TX_MODE[13] (RO)
 *
 * Indicates an TX transceiver operation is in progress.
 */
/*@{*/
/*! @brief Read current value of the XCVR_STATUS_TX_MODE field. */
#define XCVR_RD_STATUS_TX_MODE(base) ((XCVR_STATUS_REG(base) & XCVR_STATUS_TX_MODE_MASK) >> XCVR_STATUS_TX_MODE_SHIFT)
#define XCVR_BRD_STATUS_TX_MODE(base) (BME_UBFX32(&XCVR_STATUS_REG(base), XCVR_STATUS_TX_MODE_SHIFT, XCVR_STATUS_TX_MODE_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_STATUS, field BTLE_SYSCLK_REQ[16] (RO)
 *
 * Reflects the state of the BTLE oscillator request signal. BTLE_SYSCLK_REQ is
 * the BTLE control for the RF Oscillator. BTLE will deassert this signal upon
 * entering DSM (deep sleep mode) to request oscillator turn-off, and will
 * re-assert it prior to exiting DSM. The turn-on leadtime on this signal for exiting
 * DSM, is programmable with the BTLE block. This read-only bit can thus be queried
 * to ascertain the power-state of BTLE.
 */
/*@{*/
/*! @brief Read current value of the XCVR_STATUS_BTLE_SYSCLK_REQ field. */
#define XCVR_RD_STATUS_BTLE_SYSCLK_REQ(base) ((XCVR_STATUS_REG(base) & XCVR_STATUS_BTLE_SYSCLK_REQ_MASK) >> XCVR_STATUS_BTLE_SYSCLK_REQ_SHIFT)
#define XCVR_BRD_STATUS_BTLE_SYSCLK_REQ(base) (BME_UBFX32(&XCVR_STATUS_REG(base), XCVR_STATUS_BTLE_SYSCLK_REQ_SHIFT, XCVR_STATUS_BTLE_SYSCLK_REQ_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_STATUS, field RIF_LL_ACTIVE[17] (RO)
 *
 * Reflects the state of the BTLE "Link Layer Active" status bit. RIF_LL_ACTIVE
 * is to be used by the host as an 'early' indication to prevent host to do any
 * operations while BTLE IP is doing transceiver operations, so as to reduce the
 * peak power and noise.
 */
/*@{*/
/*! @brief Read current value of the XCVR_STATUS_RIF_LL_ACTIVE field. */
#define XCVR_RD_STATUS_RIF_LL_ACTIVE(base) ((XCVR_STATUS_REG(base) & XCVR_STATUS_RIF_LL_ACTIVE_MASK) >> XCVR_STATUS_RIF_LL_ACTIVE_SHIFT)
#define XCVR_BRD_STATUS_RIF_LL_ACTIVE(base) (BME_UBFX32(&XCVR_STATUS_REG(base), XCVR_STATUS_RIF_LL_ACTIVE_SHIFT, XCVR_STATUS_RIF_LL_ACTIVE_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_STATUS, field XTAL_READY[18] (RO)
 *
 * Oscillator warmup count complete.
 *
 * Values:
 * - 0b0 - Indicates that the RF Oscillator is disabled or has not completed its
 *     warmup.
 * - 0b1 - Indicates that the RF Oscillator has completed its warmup count and
 *     is ready for use.
 */
/*@{*/
/*! @brief Read current value of the XCVR_STATUS_XTAL_READY field. */
#define XCVR_RD_STATUS_XTAL_READY(base) ((XCVR_STATUS_REG(base) & XCVR_STATUS_XTAL_READY_MASK) >> XCVR_STATUS_XTAL_READY_SHIFT)
#define XCVR_BRD_STATUS_XTAL_READY(base) (BME_UBFX32(&XCVR_STATUS_REG(base), XCVR_STATUS_XTAL_READY_SHIFT, XCVR_STATUS_XTAL_READY_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_STATUS, field SOC_USING_RF_OSC_CLK[19] (RO)
 *
 * SoC signal from the CLKGEN that asserts high when the MCG is configured to
 * use RF OSC clock as the SoC clock source
 */
/*@{*/
/*! @brief Read current value of the XCVR_STATUS_SOC_USING_RF_OSC_CLK field. */
#define XCVR_RD_STATUS_SOC_USING_RF_OSC_CLK(base) ((XCVR_STATUS_REG(base) & XCVR_STATUS_SOC_USING_RF_OSC_CLK_MASK) >> XCVR_STATUS_SOC_USING_RF_OSC_CLK_SHIFT)
#define XCVR_BRD_STATUS_SOC_USING_RF_OSC_CLK(base) (BME_UBFX32(&XCVR_STATUS_REG(base), XCVR_STATUS_SOC_USING_RF_OSC_CLK_SHIFT, XCVR_STATUS_SOC_USING_RF_OSC_CLK_WIDTH))
/*@}*/

