zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKW40Z4/MKW40Z4_extension.h
/*! @brief Set the ABORT_ON_FREQ_TARG field to a new value. */
#define XCVR_WR_TSM_CTRL_ABORT_ON_FREQ_TARG(base, value) (XCVR_RMW_TSM_CTRL(base, XCVR_TSM_CTRL_ABORT_ON_FREQ_TARG_MASK, XCVR_TSM_CTRL_ABORT_ON_FREQ_TARG(value)))
#define XCVR_BWR_TSM_CTRL_ABORT_ON_FREQ_TARG(base, value) (BME_BFI32(&XCVR_TSM_CTRL_REG(base), ((uint32_t)(value) << XCVR_TSM_CTRL_ABORT_ON_FREQ_TARG_SHIFT), XCVR_TSM_CTRL_ABORT_ON_FREQ_TARG_SHIFT, XCVR_TSM_CTRL_ABORT_ON_FREQ_TARG_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_TSM_CTRL, field BKPT[31:24] (RW)
 *
 * Temporarily halt a TSM sequence during the warmup or warmdown phase. When the
 * TSM counter matches the value of BKPT[7:0], breakpoint will take effect and
 * the TSM counter will stop and hold its count. Breakpoint will remain in effect
 * as long as BKPT[7:0] matches the TSM counter value. The TSM Breakpoint can be
 * lifted by modifying the contents of this register. The default value of this
 * register, 0xFF, is greater than the length of the longest possible sequence, so
 * a breakpoint will never be triggered unless BKPT[7:0] is programmed to a
 * value less than the length of sequence.
 */
/*@{*/
/*! @brief Read current value of the XCVR_TSM_CTRL_BKPT field. */
#define XCVR_RD_TSM_CTRL_BKPT(base) ((XCVR_TSM_CTRL_REG(base) & XCVR_TSM_CTRL_BKPT_MASK) >> XCVR_TSM_CTRL_BKPT_SHIFT)
#define XCVR_BRD_TSM_CTRL_BKPT(base) (BME_UBFX32(&XCVR_TSM_CTRL_REG(base), XCVR_TSM_CTRL_BKPT_SHIFT, XCVR_TSM_CTRL_BKPT_WIDTH))

/*! @brief Set the BKPT field to a new value. */
#define XCVR_WR_TSM_CTRL_BKPT(base, value) (XCVR_RMW_TSM_CTRL(base, XCVR_TSM_CTRL_BKPT_MASK, XCVR_TSM_CTRL_BKPT(value)))
#define XCVR_BWR_TSM_CTRL_BKPT(base, value) (BME_BFI32(&XCVR_TSM_CTRL_REG(base), ((uint32_t)(value) << XCVR_TSM_CTRL_BKPT_SHIFT), XCVR_TSM_CTRL_BKPT_SHIFT, XCVR_TSM_CTRL_BKPT_WIDTH))
/*@}*/

/*******************************************************************************
 * XCVR_END_OF_SEQ - End of Sequence Control
 ******************************************************************************/

/*!
 * @brief XCVR_END_OF_SEQ - End of Sequence Control (RW)
 *
 * Reset value: 0x65646A67U
 */
/*!
 * @name Constants and macros for entire XCVR_END_OF_SEQ register
 */
/*@{*/
#define XCVR_RD_END_OF_SEQ(base) (XCVR_END_OF_SEQ_REG(base))
#define XCVR_WR_END_OF_SEQ(base, value) (XCVR_END_OF_SEQ_REG(base) = (value))
#define XCVR_RMW_END_OF_SEQ(base, mask, value) (XCVR_WR_END_OF_SEQ(base, (XCVR_RD_END_OF_SEQ(base) & ~(mask)) | (value)))
#define XCVR_SET_END_OF_SEQ(base, value) (BME_OR32(&XCVR_END_OF_SEQ_REG(base), (uint32_t)(value)))
#define XCVR_CLR_END_OF_SEQ(base, value) (BME_AND32(&XCVR_END_OF_SEQ_REG(base), (uint32_t)(~(value))))
#define XCVR_TOG_END_OF_SEQ(base, value) (BME_XOR32(&XCVR_END_OF_SEQ_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XCVR_END_OF_SEQ bitfields
 */

/*!
 * @name Register XCVR_END_OF_SEQ, field END_OF_TX_WU[7:0] (RW)
 *
 * This register defines the length of the TSM TX warmup sequence. After the
 * assertion of a TX sequence-initiating event, when the TSM counter reaches the
 * count matching this register, it will stop and hold its count, and the TSM will
 * transition from the WARMUP to the ON phase.
 */
/*@{*/
/*! @brief Read current value of the XCVR_END_OF_SEQ_END_OF_TX_WU field. */
#define XCVR_RD_END_OF_SEQ_END_OF_TX_WU(base) ((XCVR_END_OF_SEQ_REG(base) & XCVR_END_OF_SEQ_END_OF_TX_WU_MASK) >> XCVR_END_OF_SEQ_END_OF_TX_WU_SHIFT)
#define XCVR_BRD_END_OF_SEQ_END_OF_TX_WU(base) (BME_UBFX32(&XCVR_END_OF_SEQ_REG(base), XCVR_END_OF_SEQ_END_OF_TX_WU_SHIFT, XCVR_END_OF_SEQ_END_OF_TX_WU_WIDTH))

/*! @brief Set the END_OF_TX_WU field to a new value. */
#define XCVR_WR_END_OF_SEQ_END_OF_TX_WU(base, value) (XCVR_RMW_END_OF_SEQ(base, XCVR_END_OF_SEQ_END_OF_TX_WU_MASK, XCVR_END_OF_SEQ_END_OF_TX_WU(value)))
#define XCVR_BWR_END_OF_SEQ_END_OF_TX_WU(base, value) (BME_BFI32(&XCVR_END_OF_SEQ_REG(base), ((uint32_t)(value) << XCVR_END_OF_SEQ_END_OF_TX_WU_SHIFT), XCVR_END_OF_SEQ_END_OF_TX_WU_SHIFT, XCVR_END_OF_SEQ_END_OF_TX_WU_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_END_OF_SEQ, field END_OF_TX_WD[15:8] (RW)
 *
 * This register defines the point at which the TSM TX sequence warmdown
 * completes, and the TSM returns to idle. The duration of the TSM warmdown phase is
 * determined by: END_OF_TX_WD - END_OF_TX_WU. For example: the sequence register
 * defaults render the END_OF_TX_WD=0x69 and END_OF_TX_WU=0x66, so the duration of
 * the warmdown phase is 0x69 - 0x66 = 3 microseconds.
 */
/*@{*/
/*! @brief Read current value of the XCVR_END_OF_SEQ_END_OF_TX_WD field. */
#define XCVR_RD_END_OF_SEQ_END_OF_TX_WD(base) ((XCVR_END_OF_SEQ_REG(base) & XCVR_END_OF_SEQ_END_OF_TX_WD_MASK) >> XCVR_END_OF_SEQ_END_OF_TX_WD_SHIFT)
#define XCVR_BRD_END_OF_SEQ_END_OF_TX_WD(base) (BME_UBFX32(&XCVR_END_OF_SEQ_REG(base), XCVR_END_OF_SEQ_END_OF_TX_WD_SHIFT, XCVR_END_OF_SEQ_END_OF_TX_WD_WIDTH))

/*! @brief Set the END_OF_TX_WD field to a new value. */
#define XCVR_WR_END_OF_SEQ_END_OF_TX_WD(base, value) (XCVR_RMW_END_OF_SEQ(base, XCVR_END_OF_SEQ_END_OF_TX_WD_MASK, XCVR_END_OF_SEQ_END_OF_TX_WD(value)))
#define XCVR_BWR_END_OF_SEQ_END_OF_TX_WD(base, value) (BME_BFI32(&XCVR_END_OF_SEQ_REG(base), ((uint32_t)(value) << XCVR_END_OF_SEQ_END_OF_TX_WD_SHIFT), XCVR_END_OF_SEQ_END_OF_TX_WD_SHIFT, XCVR_END_OF_SEQ_END_OF_TX_WD_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_END_OF_SEQ, field END_OF_RX_WU[23:16] (RW)
 *
 * This register defines the length of the TSM RX warmup sequence. After the
 * assertion of a RX sequence-initiating event, when the TSM counter reaches the
 * count matching this register, it will stop and hold its count, and the TSM will
 * transition from the WARMUP to the ON phase.
 */
/*@{*/
/*! @brief Read current value of the XCVR_END_OF_SEQ_END_OF_RX_WU field. */
#define XCVR_RD_END_OF_SEQ_END_OF_RX_WU(base) ((XCVR_END_OF_SEQ_REG(base) & XCVR_END_OF_SEQ_END_OF_RX_WU_MASK) >> XCVR_END_OF_SEQ_END_OF_RX_WU_SHIFT)
#define XCVR_BRD_END_OF_SEQ_END_OF_RX_WU(base) (BME_UBFX32(&XCVR_END_OF_SEQ_REG(base), XCVR_END_OF_SEQ_END_OF_RX_WU_SHIFT, XCVR_END_OF_SEQ_END_OF_RX_WU_WIDTH))

