zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKW40Z4/MKW40Z4_extension.h
/*! @brief Set the HPM_LSB_INVERT field to a new value. */
#define XCVR_WR_ANA_SPARE_HPM_LSB_INVERT(base, value) (XCVR_RMW_ANA_SPARE(base, XCVR_ANA_SPARE_HPM_LSB_INVERT_MASK, XCVR_ANA_SPARE_HPM_LSB_INVERT(value)))
#define XCVR_BWR_ANA_SPARE_HPM_LSB_INVERT(base, value) (BME_BFI32(&XCVR_ANA_SPARE_REG(base), ((uint32_t)(value) << XCVR_ANA_SPARE_HPM_LSB_INVERT_SHIFT), XCVR_ANA_SPARE_HPM_LSB_INVERT_SHIFT, XCVR_ANA_SPARE_HPM_LSB_INVERT_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_ANA_SPARE, field ANA_DTEST[21:16] (RO)
 *
 * Not currently implemented, reads back zero.
 */
/*@{*/
/*! @brief Read current value of the XCVR_ANA_SPARE_ANA_DTEST field. */
#define XCVR_RD_ANA_SPARE_ANA_DTEST(base) ((XCVR_ANA_SPARE_REG(base) & XCVR_ANA_SPARE_ANA_DTEST_MASK) >> XCVR_ANA_SPARE_ANA_DTEST_SHIFT)
#define XCVR_BRD_ANA_SPARE_ANA_DTEST(base) (BME_UBFX32(&XCVR_ANA_SPARE_REG(base), XCVR_ANA_SPARE_ANA_DTEST_SHIFT, XCVR_ANA_SPARE_ANA_DTEST_WIDTH))
/*@}*/

/*
 * MKW40Z4 ZLL
 *
 * Zigbee Link Layer
 *
 * Registers defined in this header file:
 * - ZLL_IRQSTS - INTERRUPT REQUEST STATUS
 * - ZLL_PHY_CTRL - PHY CONTROL
 * - ZLL_EVENT_TMR - EVENT TIMER
 * - ZLL_TIMESTAMP - TIMESTAMP
 * - ZLL_T1CMP - T1 COMPARE
 * - ZLL_T2CMP - T2 COMPARE
 * - ZLL_T2PRIMECMP - T2 PRIME COMPARE
 * - ZLL_T3CMP - T3 COMPARE
 * - ZLL_T4CMP - T4 COMPARE
 * - ZLL_PA_PWR - PA POWER
 * - ZLL_CHANNEL_NUM0 - CHANNEL NUMBER 0
 * - ZLL_LQI_AND_RSSI - LQI AND RSSI
 * - ZLL_MACSHORTADDRS0 - MAC SHORT ADDRESS 0
 * - ZLL_MACLONGADDRS0_LSB - MAC LONG ADDRESS 0 LSB
 * - ZLL_MACLONGADDRS0_MSB - MAC LONG ADDRESS 0 MSB
 * - ZLL_RX_FRAME_FILTER - RECEIVE FRAME FILTER
 * - ZLL_CCA_LQI_CTRL - CCA AND LQI CONTROL
 * - ZLL_CCA2_CTRL - CCA2 CONTROL
 * - ZLL_FAD_CTRL - FAD CONTROL
 * - ZLL_SNF_CTRL - SNF CONTROL
 * - ZLL_BSM_CTRL - BSM CONTROL
 * - ZLL_MACSHORTADDRS1 - MAC SHORT ADDRESS 1
 * - ZLL_MACLONGADDRS1_LSB - MAC LONG ADDRESS 1 LSB
 * - ZLL_MACLONGADDRS1_MSB - MAC LONG ADDRESS 1 MSB
 * - ZLL_DUAL_PAN_CTRL - DUAL PAN CONTROL
 * - ZLL_CHANNEL_NUM1 - CHANNEL NUMBER 1
 * - ZLL_SAM_CTRL - SAM CONTROL
 * - ZLL_SAM_TABLE - SOURCE ADDRESS MANAGEMENT TABLE
 * - ZLL_SAM_MATCH - SAM MATCH
 * - ZLL_SAM_FREE_IDX - SAM FREE INDEX
 * - ZLL_SEQ_CTRL_STS - SEQUENCE CONTROL AND STATUS
 * - ZLL_ACKDELAY - ACK DELAY
 * - ZLL_FILTERFAIL_CODE - FILTER FAIL CODE
 * - ZLL_RX_WTR_MARK - RECEIVE WATER MARK
 * - ZLL_SLOT_PRELOAD - SLOT PRELOAD
 * - ZLL_SEQ_STATE - ZIGBEE SEQUENCE STATE
 * - ZLL_TMR_PRESCALE - TIMER PRESCALER
 * - ZLL_LENIENCY_LSB - LENIENCY LSB
 * - ZLL_LENIENCY_MSB - LENIENCY MSB
 * - ZLL_PART_ID - PART ID
 * - ZLL_PKT_BUFFER - PACKET BUFFER
 */

#define ZLL_INSTANCE_COUNT (1U) /*!< Number of instances of the ZLL module. */
#define ZLL_IDX (0U) /*!< Instance number for ZLL. */

/*******************************************************************************
 * ZLL_IRQSTS - INTERRUPT REQUEST STATUS
 ******************************************************************************/

/*!
 * @brief ZLL_IRQSTS - INTERRUPT REQUEST STATUS (RW)
 *
 * Reset value: 0x00F00000U
 *
 * Zigbee Interrupt Request Status
 */
/*!
 * @name Constants and macros for entire ZLL_IRQSTS register
 */
/*@{*/
#define ZLL_RD_IRQSTS(base)      (ZLL_IRQSTS_REG(base))
#define ZLL_WR_IRQSTS(base, value) (ZLL_IRQSTS_REG(base) = (value))
#define ZLL_RMW_IRQSTS(base, mask, value) (ZLL_WR_IRQSTS(base, (ZLL_RD_IRQSTS(base) & ~(mask)) | (value)))
#define ZLL_SET_IRQSTS(base, value) (BME_OR32(&ZLL_IRQSTS_REG(base), (uint32_t)(value)))
#define ZLL_CLR_IRQSTS(base, value) (BME_AND32(&ZLL_IRQSTS_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_IRQSTS(base, value) (BME_XOR32(&ZLL_IRQSTS_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_IRQSTS bitfields
 */

/*!
 * @name Register ZLL_IRQSTS, field SEQIRQ[0] (W1C)
 *
 * Values:
 * - 0b0 - A Sequencer Interrupt has not occurred
 * - 0b1 - A Sequencer Interrupt has occurred
 */
/*@{*/
/*! @brief Read current value of the ZLL_IRQSTS_SEQIRQ field. */
#define ZLL_RD_IRQSTS_SEQIRQ(base) ((ZLL_IRQSTS_REG(base) & ZLL_IRQSTS_SEQIRQ_MASK) >> ZLL_IRQSTS_SEQIRQ_SHIFT)
#define ZLL_BRD_IRQSTS_SEQIRQ(base) (BME_UBFX32(&ZLL_IRQSTS_REG(base), ZLL_IRQSTS_SEQIRQ_SHIFT, ZLL_IRQSTS_SEQIRQ_WIDTH))

/*! @brief Set the SEQIRQ field to a new value. */
#define ZLL_WR_IRQSTS_SEQIRQ(base, value) (ZLL_RMW_IRQSTS(base, (ZLL_IRQSTS_SEQIRQ_MASK | ZLL_IRQSTS_TXIRQ_MASK | ZLL_IRQSTS_RXIRQ_MASK | ZLL_IRQSTS_CCAIRQ_MASK | ZLL_IRQSTS_RXWTRMRKIRQ_MASK | ZLL_IRQSTS_FILTERFAIL_IRQ_MASK | ZLL_IRQSTS_PLL_UNLOCK_IRQ_MASK | ZLL_IRQSTS_PB_ERR_IRQ_MASK | ZLL_IRQSTS_TMR1IRQ_MASK | ZLL_IRQSTS_TMR2IRQ_MASK | ZLL_IRQSTS_TMR3IRQ_MASK | ZLL_IRQSTS_TMR4IRQ_MASK), ZLL_IRQSTS_SEQIRQ(value)))
#define ZLL_BWR_IRQSTS_SEQIRQ(base, value) (BME_BFI32(&ZLL_IRQSTS_REG(base), ((uint32_t)(value) << ZLL_IRQSTS_SEQIRQ_SHIFT), ZLL_IRQSTS_SEQIRQ_SHIFT, ZLL_IRQSTS_SEQIRQ_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_IRQSTS, field TXIRQ[1] (W1C)
 *
 * Values:
 * - 0b0 - A TX Interrupt has not occurred
 * - 0b1 - A TX Interrupt has occurred
 */
/*@{*/
/*! @brief Read current value of the ZLL_IRQSTS_TXIRQ field. */
#define ZLL_RD_IRQSTS_TXIRQ(base) ((ZLL_IRQSTS_REG(base) & ZLL_IRQSTS_TXIRQ_MASK) >> ZLL_IRQSTS_TXIRQ_SHIFT)
#define ZLL_BRD_IRQSTS_TXIRQ(base) (BME_UBFX32(&ZLL_IRQSTS_REG(base), ZLL_IRQSTS_TXIRQ_SHIFT, ZLL_IRQSTS_TXIRQ_WIDTH))

/*! @brief Set the TXIRQ field to a new value. */
#define ZLL_WR_IRQSTS_TXIRQ(base, value) (ZLL_RMW_IRQSTS(base, (ZLL_IRQSTS_TXIRQ_MASK | ZLL_IRQSTS_SEQIRQ_MASK | ZLL_IRQSTS_RXIRQ_MASK | ZLL_IRQSTS_CCAIRQ_MASK | ZLL_IRQSTS_RXWTRMRKIRQ_MASK | ZLL_IRQSTS_FILTERFAIL_IRQ_MASK | ZLL_IRQSTS_PLL_UNLOCK_IRQ_MASK | ZLL_IRQSTS_PB_ERR_IRQ_MASK | ZLL_IRQSTS_TMR1IRQ_MASK | ZLL_IRQSTS_TMR2IRQ_MASK | ZLL_IRQSTS_TMR3IRQ_MASK | ZLL_IRQSTS_TMR4IRQ_MASK), ZLL_IRQSTS_TXIRQ(value)))
#define ZLL_BWR_IRQSTS_TXIRQ(base, value) (BME_BFI32(&ZLL_IRQSTS_REG(base), ((uint32_t)(value) << ZLL_IRQSTS_TXIRQ_SHIFT), ZLL_IRQSTS_TXIRQ_SHIFT, ZLL_IRQSTS_TXIRQ_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_IRQSTS, field RXIRQ[2] (W1C)
 *
 * Values:
 * - 0b0 - A RX Interrupt has not occurred
 * - 0b1 - A RX Interrupt has occurred
 */
/*@{*/
/*! @brief Read current value of the ZLL_IRQSTS_RXIRQ field. */
#define ZLL_RD_IRQSTS_RXIRQ(base) ((ZLL_IRQSTS_REG(base) & ZLL_IRQSTS_RXIRQ_MASK) >> ZLL_IRQSTS_RXIRQ_SHIFT)
#define ZLL_BRD_IRQSTS_RXIRQ(base) (BME_UBFX32(&ZLL_IRQSTS_REG(base), ZLL_IRQSTS_RXIRQ_SHIFT, ZLL_IRQSTS_RXIRQ_WIDTH))

/*! @brief Set the RXIRQ field to a new value. */
#define ZLL_WR_IRQSTS_RXIRQ(base, value) (ZLL_RMW_IRQSTS(base, (ZLL_IRQSTS_RXIRQ_MASK | ZLL_IRQSTS_SEQIRQ_MASK | ZLL_IRQSTS_TXIRQ_MASK | ZLL_IRQSTS_CCAIRQ_MASK | ZLL_IRQSTS_RXWTRMRKIRQ_MASK | ZLL_IRQSTS_FILTERFAIL_IRQ_MASK | ZLL_IRQSTS_PLL_UNLOCK_IRQ_MASK | ZLL_IRQSTS_PB_ERR_IRQ_MASK | ZLL_IRQSTS_TMR1IRQ_MASK | ZLL_IRQSTS_TMR2IRQ_MASK | ZLL_IRQSTS_TMR3IRQ_MASK | ZLL_IRQSTS_TMR4IRQ_MASK), ZLL_IRQSTS_RXIRQ(value)))
#define ZLL_BWR_IRQSTS_RXIRQ(base, value) (BME_BFI32(&ZLL_IRQSTS_REG(base), ((uint32_t)(value) << ZLL_IRQSTS_RXIRQ_SHIFT), ZLL_IRQSTS_RXIRQ_SHIFT, ZLL_IRQSTS_RXIRQ_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_IRQSTS, field CCAIRQ[3] (W1C)
 *
 * Values:
 * - 0b0 - A CCA Interrupt has not occurred
 * - 0b1 - A CCA Interrupt has occurred
 */
/*@{*/
/*! @brief Read current value of the ZLL_IRQSTS_CCAIRQ field. */
#define ZLL_RD_IRQSTS_CCAIRQ(base) ((ZLL_IRQSTS_REG(base) & ZLL_IRQSTS_CCAIRQ_MASK) >> ZLL_IRQSTS_CCAIRQ_SHIFT)
#define ZLL_BRD_IRQSTS_CCAIRQ(base) (BME_UBFX32(&ZLL_IRQSTS_REG(base), ZLL_IRQSTS_CCAIRQ_SHIFT, ZLL_IRQSTS_CCAIRQ_WIDTH))

/*! @brief Set the CCAIRQ field to a new value. */
#define ZLL_WR_IRQSTS_CCAIRQ(base, value) (ZLL_RMW_IRQSTS(base, (ZLL_IRQSTS_CCAIRQ_MASK | ZLL_IRQSTS_SEQIRQ_MASK | ZLL_IRQSTS_TXIRQ_MASK | ZLL_IRQSTS_RXIRQ_MASK | ZLL_IRQSTS_RXWTRMRKIRQ_MASK | ZLL_IRQSTS_FILTERFAIL_IRQ_MASK | ZLL_IRQSTS_PLL_UNLOCK_IRQ_MASK | ZLL_IRQSTS_PB_ERR_IRQ_MASK | ZLL_IRQSTS_TMR1IRQ_MASK | ZLL_IRQSTS_TMR2IRQ_MASK | ZLL_IRQSTS_TMR3IRQ_MASK | ZLL_IRQSTS_TMR4IRQ_MASK), ZLL_IRQSTS_CCAIRQ(value)))
#define ZLL_BWR_IRQSTS_CCAIRQ(base, value) (BME_BFI32(&ZLL_IRQSTS_REG(base), ((uint32_t)(value) << ZLL_IRQSTS_CCAIRQ_SHIFT), ZLL_IRQSTS_CCAIRQ_SHIFT, ZLL_IRQSTS_CCAIRQ_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_IRQSTS, field RXWTRMRKIRQ[4] (W1C)
 *
 * Values:
 * - 0b0 - A RX Watermark Interrupt has not occurred
 * - 0b1 - A RX Watermark Interrupt has occurred
 */
/*@{*/
/*! @brief Read current value of the ZLL_IRQSTS_RXWTRMRKIRQ field. */
#define ZLL_RD_IRQSTS_RXWTRMRKIRQ(base) ((ZLL_IRQSTS_REG(base) & ZLL_IRQSTS_RXWTRMRKIRQ_MASK) >> ZLL_IRQSTS_RXWTRMRKIRQ_SHIFT)
#define ZLL_BRD_IRQSTS_RXWTRMRKIRQ(base) (BME_UBFX32(&ZLL_IRQSTS_REG(base), ZLL_IRQSTS_RXWTRMRKIRQ_SHIFT, ZLL_IRQSTS_RXWTRMRKIRQ_WIDTH))

/*! @brief Set the RXWTRMRKIRQ field to a new value. */
#define ZLL_WR_IRQSTS_RXWTRMRKIRQ(base, value) (ZLL_RMW_IRQSTS(base, (ZLL_IRQSTS_RXWTRMRKIRQ_MASK | ZLL_IRQSTS_SEQIRQ_MASK | ZLL_IRQSTS_TXIRQ_MASK | ZLL_IRQSTS_RXIRQ_MASK | ZLL_IRQSTS_CCAIRQ_MASK | ZLL_IRQSTS_FILTERFAIL_IRQ_MASK | ZLL_IRQSTS_PLL_UNLOCK_IRQ_MASK | ZLL_IRQSTS_PB_ERR_IRQ_MASK | ZLL_IRQSTS_TMR1IRQ_MASK | ZLL_IRQSTS_TMR2IRQ_MASK | ZLL_IRQSTS_TMR3IRQ_MASK | ZLL_IRQSTS_TMR4IRQ_MASK), ZLL_IRQSTS_RXWTRMRKIRQ(value)))
#define ZLL_BWR_IRQSTS_RXWTRMRKIRQ(base, value) (BME_BFI32(&ZLL_IRQSTS_REG(base), ((uint32_t)(value) << ZLL_IRQSTS_RXWTRMRKIRQ_SHIFT), ZLL_IRQSTS_RXWTRMRKIRQ_SHIFT, ZLL_IRQSTS_RXWTRMRKIRQ_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_IRQSTS, field FILTERFAIL_IRQ[5] (W1C)
 *
 * Values:
 * - 0b0 - A Filter Fail Interrupt has not occurred
 * - 0b1 - A Filter Fail Interrupt has occurred
 */
/*@{*/
/*! @brief Read current value of the ZLL_IRQSTS_FILTERFAIL_IRQ field. */
#define ZLL_RD_IRQSTS_FILTERFAIL_IRQ(base) ((ZLL_IRQSTS_REG(base) & ZLL_IRQSTS_FILTERFAIL_IRQ_MASK) >> ZLL_IRQSTS_FILTERFAIL_IRQ_SHIFT)
#define ZLL_BRD_IRQSTS_FILTERFAIL_IRQ(base) (BME_UBFX32(&ZLL_IRQSTS_REG(base), ZLL_IRQSTS_FILTERFAIL_IRQ_SHIFT, ZLL_IRQSTS_FILTERFAIL_IRQ_WIDTH))

