zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKW40Z4/MKW40Z4_extension.h
/*******************************************************************************
 * ZLL_SNF_CTRL - SNF CONTROL
 ******************************************************************************/

/*!
 * @brief ZLL_SNF_CTRL - SNF CONTROL (RW)
 *
 * Reset value: 0x00000000U
 *
 * SNIFF Mode Control Register
 */
/*!
 * @name Constants and macros for entire ZLL_SNF_CTRL register
 */
/*@{*/
#define ZLL_RD_SNF_CTRL(base)    (ZLL_SNF_CTRL_REG(base))
#define ZLL_WR_SNF_CTRL(base, value) (ZLL_SNF_CTRL_REG(base) = (value))
#define ZLL_RMW_SNF_CTRL(base, mask, value) (ZLL_WR_SNF_CTRL(base, (ZLL_RD_SNF_CTRL(base) & ~(mask)) | (value)))
#define ZLL_SET_SNF_CTRL(base, value) (BME_OR32(&ZLL_SNF_CTRL_REG(base), (uint32_t)(value)))
#define ZLL_CLR_SNF_CTRL(base, value) (BME_AND32(&ZLL_SNF_CTRL_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_SNF_CTRL(base, value) (BME_XOR32(&ZLL_SNF_CTRL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_SNF_CTRL bitfields
 */

/*!
 * @name Register ZLL_SNF_CTRL, field SNF_EN[0] (RW)
 *
 * SNIFF Mode Enable. Note: SNIFF Mode not currently supported. SNF_EN has no
 * effect
 */
/*@{*/
/*! @brief Read current value of the ZLL_SNF_CTRL_SNF_EN field. */
#define ZLL_RD_SNF_CTRL_SNF_EN(base) ((ZLL_SNF_CTRL_REG(base) & ZLL_SNF_CTRL_SNF_EN_MASK) >> ZLL_SNF_CTRL_SNF_EN_SHIFT)
#define ZLL_BRD_SNF_CTRL_SNF_EN(base) (BME_UBFX32(&ZLL_SNF_CTRL_REG(base), ZLL_SNF_CTRL_SNF_EN_SHIFT, ZLL_SNF_CTRL_SNF_EN_WIDTH))

/*! @brief Set the SNF_EN field to a new value. */
#define ZLL_WR_SNF_CTRL_SNF_EN(base, value) (ZLL_RMW_SNF_CTRL(base, ZLL_SNF_CTRL_SNF_EN_MASK, ZLL_SNF_CTRL_SNF_EN(value)))
#define ZLL_BWR_SNF_CTRL_SNF_EN(base, value) (BME_BFI32(&ZLL_SNF_CTRL_REG(base), ((uint32_t)(value) << ZLL_SNF_CTRL_SNF_EN_SHIFT), ZLL_SNF_CTRL_SNF_EN_SHIFT, ZLL_SNF_CTRL_SNF_EN_WIDTH))
/*@}*/

/*******************************************************************************
 * ZLL_BSM_CTRL - BSM CONTROL
 ******************************************************************************/

/*!
 * @brief ZLL_BSM_CTRL - BSM CONTROL (RW)
 *
 * Reset value: 0x00000000U
 *
 * Bit Streaming Mode Control Register
 */
/*!
 * @name Constants and macros for entire ZLL_BSM_CTRL register
 */
/*@{*/
#define ZLL_RD_BSM_CTRL(base)    (ZLL_BSM_CTRL_REG(base))
#define ZLL_WR_BSM_CTRL(base, value) (ZLL_BSM_CTRL_REG(base) = (value))
#define ZLL_RMW_BSM_CTRL(base, mask, value) (ZLL_WR_BSM_CTRL(base, (ZLL_RD_BSM_CTRL(base) & ~(mask)) | (value)))
#define ZLL_SET_BSM_CTRL(base, value) (BME_OR32(&ZLL_BSM_CTRL_REG(base), (uint32_t)(value)))
#define ZLL_CLR_BSM_CTRL(base, value) (BME_AND32(&ZLL_BSM_CTRL_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_BSM_CTRL(base, value) (BME_XOR32(&ZLL_BSM_CTRL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_BSM_CTRL bitfields
 */

/*!
 * @name Register ZLL_BSM_CTRL, field BSM_EN[0] (RW)
 *
 * Values:
 * - 0b0 - Zigbee Bit Streaming Mode Disabled
 * - 0b1 - Zigbee Bit Streaming Mode Enabled
 */
/*@{*/
/*! @brief Read current value of the ZLL_BSM_CTRL_BSM_EN field. */
#define ZLL_RD_BSM_CTRL_BSM_EN(base) ((ZLL_BSM_CTRL_REG(base) & ZLL_BSM_CTRL_BSM_EN_MASK) >> ZLL_BSM_CTRL_BSM_EN_SHIFT)
#define ZLL_BRD_BSM_CTRL_BSM_EN(base) (BME_UBFX32(&ZLL_BSM_CTRL_REG(base), ZLL_BSM_CTRL_BSM_EN_SHIFT, ZLL_BSM_CTRL_BSM_EN_WIDTH))

/*! @brief Set the BSM_EN field to a new value. */
#define ZLL_WR_BSM_CTRL_BSM_EN(base, value) (ZLL_RMW_BSM_CTRL(base, ZLL_BSM_CTRL_BSM_EN_MASK, ZLL_BSM_CTRL_BSM_EN(value)))
#define ZLL_BWR_BSM_CTRL_BSM_EN(base, value) (BME_BFI32(&ZLL_BSM_CTRL_REG(base), ((uint32_t)(value) << ZLL_BSM_CTRL_BSM_EN_SHIFT), ZLL_BSM_CTRL_BSM_EN_SHIFT, ZLL_BSM_CTRL_BSM_EN_WIDTH))
/*@}*/

/*******************************************************************************
 * ZLL_MACSHORTADDRS1 - MAC SHORT ADDRESS 1
 ******************************************************************************/

/*!
 * @brief ZLL_MACSHORTADDRS1 - MAC SHORT ADDRESS 1 (RW)
 *
 * Reset value: 0xFFFFFFFFU
 */
/*!
 * @name Constants and macros for entire ZLL_MACSHORTADDRS1 register
 */
/*@{*/
#define ZLL_RD_MACSHORTADDRS1(base) (ZLL_MACSHORTADDRS1_REG(base))
#define ZLL_WR_MACSHORTADDRS1(base, value) (ZLL_MACSHORTADDRS1_REG(base) = (value))
#define ZLL_RMW_MACSHORTADDRS1(base, mask, value) (ZLL_WR_MACSHORTADDRS1(base, (ZLL_RD_MACSHORTADDRS1(base) & ~(mask)) | (value)))
#define ZLL_SET_MACSHORTADDRS1(base, value) (BME_OR32(&ZLL_MACSHORTADDRS1_REG(base), (uint32_t)(value)))
#define ZLL_CLR_MACSHORTADDRS1(base, value) (BME_AND32(&ZLL_MACSHORTADDRS1_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_MACSHORTADDRS1(base, value) (BME_XOR32(&ZLL_MACSHORTADDRS1_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_MACSHORTADDRS1 bitfields
 */

/*!
 * @name Register ZLL_MACSHORTADDRS1, field MACPANID1[15:0] (RW)
 *
 * MAC PAN ID for PAN1. The packet processor compares the incoming packet's
 * Destination PAN ID against the contents of this register to determine if the
 * packet is addressed to this device; or if the incoming packet is a Beacon frame,
 * the packet processor compares the incoming packet Source PAN ID against this
 * register. Also, if PANCORDNTR1=1, and the incoming packet has no Destination
 * Address field, and if the incoming packet is a Data or MAC Command frame, the
 * packet processor compares the incoming packet Source PAN ID against this register.
 */
/*@{*/
/*! @brief Read current value of the ZLL_MACSHORTADDRS1_MACPANID1 field. */
#define ZLL_RD_MACSHORTADDRS1_MACPANID1(base) ((ZLL_MACSHORTADDRS1_REG(base) & ZLL_MACSHORTADDRS1_MACPANID1_MASK) >> ZLL_MACSHORTADDRS1_MACPANID1_SHIFT)
#define ZLL_BRD_MACSHORTADDRS1_MACPANID1(base) (BME_UBFX32(&ZLL_MACSHORTADDRS1_REG(base), ZLL_MACSHORTADDRS1_MACPANID1_SHIFT, ZLL_MACSHORTADDRS1_MACPANID1_WIDTH))

/*! @brief Set the MACPANID1 field to a new value. */
#define ZLL_WR_MACSHORTADDRS1_MACPANID1(base, value) (ZLL_RMW_MACSHORTADDRS1(base, ZLL_MACSHORTADDRS1_MACPANID1_MASK, ZLL_MACSHORTADDRS1_MACPANID1(value)))
#define ZLL_BWR_MACSHORTADDRS1_MACPANID1(base, value) (BME_BFI32(&ZLL_MACSHORTADDRS1_REG(base), ((uint32_t)(value) << ZLL_MACSHORTADDRS1_MACPANID1_SHIFT), ZLL_MACSHORTADDRS1_MACPANID1_SHIFT, ZLL_MACSHORTADDRS1_MACPANID1_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_MACSHORTADDRS1, field MACSHORTADDRS1[31:16] (RW)
 *
 * MAC Short Address for PAN1, for 16-bit destination addressing mode. The
 * packet processor compares the incoming packet's Destination Address against the
 * contents of this register to determine if the packet is addressed to this device.
 */
/*@{*/
/*! @brief Read current value of the ZLL_MACSHORTADDRS1_MACSHORTADDRS1 field. */
#define ZLL_RD_MACSHORTADDRS1_MACSHORTADDRS1(base) ((ZLL_MACSHORTADDRS1_REG(base) & ZLL_MACSHORTADDRS1_MACSHORTADDRS1_MASK) >> ZLL_MACSHORTADDRS1_MACSHORTADDRS1_SHIFT)
#define ZLL_BRD_MACSHORTADDRS1_MACSHORTADDRS1(base) (BME_UBFX32(&ZLL_MACSHORTADDRS1_REG(base), ZLL_MACSHORTADDRS1_MACSHORTADDRS1_SHIFT, ZLL_MACSHORTADDRS1_MACSHORTADDRS1_WIDTH))

