zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKW40Z4/MKW40Z4_extension.h
/*! @brief Set the NO_RX_RECYCLE field to a new value. */
#define ZLL_WR_SEQ_CTRL_STS_NO_RX_RECYCLE(base, value) (ZLL_RMW_SEQ_CTRL_STS(base, ZLL_SEQ_CTRL_STS_NO_RX_RECYCLE_MASK, ZLL_SEQ_CTRL_STS_NO_RX_RECYCLE(value)))
#define ZLL_BWR_SEQ_CTRL_STS_NO_RX_RECYCLE(base, value) (BME_BFI32(&ZLL_SEQ_CTRL_STS_REG(base), ((uint32_t)(value) << ZLL_SEQ_CTRL_STS_NO_RX_RECYCLE_SHIFT), ZLL_SEQ_CTRL_STS_NO_RX_RECYCLE_SHIFT, ZLL_SEQ_CTRL_STS_NO_RX_RECYCLE_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_CTRL_STS, field FORCE_CRC_ERROR[6] (RW)
 *
 * Values:
 * - 0b0 - normal operation
 * - 0b1 - Force the next transmitted packet to have a CRC error
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_CTRL_STS_FORCE_CRC_ERROR field. */
#define ZLL_RD_SEQ_CTRL_STS_FORCE_CRC_ERROR(base) ((ZLL_SEQ_CTRL_STS_REG(base) & ZLL_SEQ_CTRL_STS_FORCE_CRC_ERROR_MASK) >> ZLL_SEQ_CTRL_STS_FORCE_CRC_ERROR_SHIFT)
#define ZLL_BRD_SEQ_CTRL_STS_FORCE_CRC_ERROR(base) (BME_UBFX32(&ZLL_SEQ_CTRL_STS_REG(base), ZLL_SEQ_CTRL_STS_FORCE_CRC_ERROR_SHIFT, ZLL_SEQ_CTRL_STS_FORCE_CRC_ERROR_WIDTH))

/*! @brief Set the FORCE_CRC_ERROR field to a new value. */
#define ZLL_WR_SEQ_CTRL_STS_FORCE_CRC_ERROR(base, value) (ZLL_RMW_SEQ_CTRL_STS(base, ZLL_SEQ_CTRL_STS_FORCE_CRC_ERROR_MASK, ZLL_SEQ_CTRL_STS_FORCE_CRC_ERROR(value)))
#define ZLL_BWR_SEQ_CTRL_STS_FORCE_CRC_ERROR(base, value) (BME_BFI32(&ZLL_SEQ_CTRL_STS_REG(base), ((uint32_t)(value) << ZLL_SEQ_CTRL_STS_FORCE_CRC_ERROR_SHIFT), ZLL_SEQ_CTRL_STS_FORCE_CRC_ERROR_SHIFT, ZLL_SEQ_CTRL_STS_FORCE_CRC_ERROR_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_CTRL_STS, field CONTINUOUS_EN[7] (RW)
 *
 * Continuous Mode Enable (Continuous TX or RX). Note: Dual PAN mode should not
 * be engaged in Continuous TX or RX modes.
 *
 * Values:
 * - 0b0 - normal operation
 * - 0b1 - Continuous TX or RX mode is enabled (depending on XCVSEQ setting).
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_CTRL_STS_CONTINUOUS_EN field. */
#define ZLL_RD_SEQ_CTRL_STS_CONTINUOUS_EN(base) ((ZLL_SEQ_CTRL_STS_REG(base) & ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_MASK) >> ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_SHIFT)
#define ZLL_BRD_SEQ_CTRL_STS_CONTINUOUS_EN(base) (BME_UBFX32(&ZLL_SEQ_CTRL_STS_REG(base), ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_SHIFT, ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_WIDTH))

/*! @brief Set the CONTINUOUS_EN field to a new value. */
#define ZLL_WR_SEQ_CTRL_STS_CONTINUOUS_EN(base, value) (ZLL_RMW_SEQ_CTRL_STS(base, ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_MASK, ZLL_SEQ_CTRL_STS_CONTINUOUS_EN(value)))
#define ZLL_BWR_SEQ_CTRL_STS_CONTINUOUS_EN(base, value) (BME_BFI32(&ZLL_SEQ_CTRL_STS_REG(base), ((uint32_t)(value) << ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_SHIFT), ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_SHIFT, ZLL_SEQ_CTRL_STS_CONTINUOUS_EN_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_CTRL_STS, field XCVSEQ_ACTUAL[10:8] (RO)
 *
 * Reflects the programmed sequence that has been recognized by the Zigbee
 * Sequence Manager. Takes into account the fact that sequence-change commands from
 * software are ignored while a sequence is underway (see NEW_SEQ_INHIBIT).
 * Read-only bits.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_CTRL_STS_XCVSEQ_ACTUAL field. */
#define ZLL_RD_SEQ_CTRL_STS_XCVSEQ_ACTUAL(base) ((ZLL_SEQ_CTRL_STS_REG(base) & ZLL_SEQ_CTRL_STS_XCVSEQ_ACTUAL_MASK) >> ZLL_SEQ_CTRL_STS_XCVSEQ_ACTUAL_SHIFT)
#define ZLL_BRD_SEQ_CTRL_STS_XCVSEQ_ACTUAL(base) (BME_UBFX32(&ZLL_SEQ_CTRL_STS_REG(base), ZLL_SEQ_CTRL_STS_XCVSEQ_ACTUAL_SHIFT, ZLL_SEQ_CTRL_STS_XCVSEQ_ACTUAL_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_CTRL_STS, field SEQ_IDLE[11] (RO)
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_CTRL_STS_SEQ_IDLE field. */
#define ZLL_RD_SEQ_CTRL_STS_SEQ_IDLE(base) ((ZLL_SEQ_CTRL_STS_REG(base) & ZLL_SEQ_CTRL_STS_SEQ_IDLE_MASK) >> ZLL_SEQ_CTRL_STS_SEQ_IDLE_SHIFT)
#define ZLL_BRD_SEQ_CTRL_STS_SEQ_IDLE(base) (BME_UBFX32(&ZLL_SEQ_CTRL_STS_REG(base), ZLL_SEQ_CTRL_STS_SEQ_IDLE_SHIFT, ZLL_SEQ_CTRL_STS_SEQ_IDLE_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_CTRL_STS, field NEW_SEQ_INHIBIT[12] (RO)
 *
 * When asserted, indicates that a new programmed autosequence has commenced
 * (TMR2 match has occurred if TMRTRIGEN=1). Once this bit is asserted, software is
 * blocked from commanding any "new" autosequences (other than Sequence I to
 * abort the current sequence), until the current sequence completes. Hardware will
 * ignore a sequence-change command from software while this bit is asserted.
 * Hardware will automatically deassert this bit once the sequence completes.
 * Read-only bit.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_CTRL_STS_NEW_SEQ_INHIBIT field. */
#define ZLL_RD_SEQ_CTRL_STS_NEW_SEQ_INHIBIT(base) ((ZLL_SEQ_CTRL_STS_REG(base) & ZLL_SEQ_CTRL_STS_NEW_SEQ_INHIBIT_MASK) >> ZLL_SEQ_CTRL_STS_NEW_SEQ_INHIBIT_SHIFT)
#define ZLL_BRD_SEQ_CTRL_STS_NEW_SEQ_INHIBIT(base) (BME_UBFX32(&ZLL_SEQ_CTRL_STS_REG(base), ZLL_SEQ_CTRL_STS_NEW_SEQ_INHIBIT_SHIFT, ZLL_SEQ_CTRL_STS_NEW_SEQ_INHIBIT_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_CTRL_STS, field RX_TIMEOUT_PENDING[13] (RO)
 *
 * when asserted, indicates that a TMR3 timeout (RX timeout) flag has been set
 * by Hardware, but the Sequence Manager has not yet aborted because an RX
 * operation is not currently underway. This would be the case, for example, during a
 * Sequence TR, if a TMR3 timeout were to occur during the transmit operation of
 * this sequence; the sequence would not be aborted by Hardware until the receive
 * operation begins. This bit will always be 0 if TC3TMOUT=0. Read-only bit.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_CTRL_STS_RX_TIMEOUT_PENDING field. */
#define ZLL_RD_SEQ_CTRL_STS_RX_TIMEOUT_PENDING(base) ((ZLL_SEQ_CTRL_STS_REG(base) & ZLL_SEQ_CTRL_STS_RX_TIMEOUT_PENDING_MASK) >> ZLL_SEQ_CTRL_STS_RX_TIMEOUT_PENDING_SHIFT)
#define ZLL_BRD_SEQ_CTRL_STS_RX_TIMEOUT_PENDING(base) (BME_UBFX32(&ZLL_SEQ_CTRL_STS_REG(base), ZLL_SEQ_CTRL_STS_RX_TIMEOUT_PENDING_SHIFT, ZLL_SEQ_CTRL_STS_RX_TIMEOUT_PENDING_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_CTRL_STS, field RX_MODE[14] (RO)
 *
 * when asserted, this Sequence Manager Output indicates that an RX operation is
 * in progress. An RX operation can be part of a complex transmit autosequence
 * such as a Sequence TR. CCA and ED operations are considered RX operations,
 * during which rx_mode is asserted. Read-only bit.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_CTRL_STS_RX_MODE field. */
#define ZLL_RD_SEQ_CTRL_STS_RX_MODE(base) ((ZLL_SEQ_CTRL_STS_REG(base) & ZLL_SEQ_CTRL_STS_RX_MODE_MASK) >> ZLL_SEQ_CTRL_STS_RX_MODE_SHIFT)
#define ZLL_BRD_SEQ_CTRL_STS_RX_MODE(base) (BME_UBFX32(&ZLL_SEQ_CTRL_STS_REG(base), ZLL_SEQ_CTRL_STS_RX_MODE_SHIFT, ZLL_SEQ_CTRL_STS_RX_MODE_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_CTRL_STS, field TMR2_SEQ_TRIG_ARMED[15] (RO)
 *
 * when asserted, indicates that TMR2 has been programmed and is "armed" to
 * trigger a new autosequence, when Zigbee Sequence Manager timer-triggering mode is
 * selected (i.e., TMRTRIGEN=1). When timer-triggering mode is selected, TMR2
 * must be re-programmed (using either T2CMP or T2PRIMECMP), in advance of each new
 * sequence. Once TMR2 is programmed, this bit will be asserted, and will remain
 * asserted until the new sequence commences (at TMR2 match). Hardware will
 * deassert this bit when the new sequence starts. When TMRTRIGEN=0, this bit should
 * be ignored. Read-only bit.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_CTRL_STS_TMR2_SEQ_TRIG_ARMED field. */
#define ZLL_RD_SEQ_CTRL_STS_TMR2_SEQ_TRIG_ARMED(base) ((ZLL_SEQ_CTRL_STS_REG(base) & ZLL_SEQ_CTRL_STS_TMR2_SEQ_TRIG_ARMED_MASK) >> ZLL_SEQ_CTRL_STS_TMR2_SEQ_TRIG_ARMED_SHIFT)
#define ZLL_BRD_SEQ_CTRL_STS_TMR2_SEQ_TRIG_ARMED(base) (BME_UBFX32(&ZLL_SEQ_CTRL_STS_REG(base), ZLL_SEQ_CTRL_STS_TMR2_SEQ_TRIG_ARMED_SHIFT, ZLL_SEQ_CTRL_STS_TMR2_SEQ_TRIG_ARMED_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_CTRL_STS, field SEQ_T_STATUS[21:16] (RO)
 *
 * Status of the just-completed (or ongoing) Sequence T or Sequence TR
 * autosequence. This register is valid at all times during, and after, the Sequence T or
 * Sequence TR. Not valid for other types of autosequences. This is a read-only
 * register. The bits of this register map to status, according to the following
 * table: [0] 1st CCA complete (CCABFRTX=1) [1] 2nd CCA complete (SLOTTED=1) [2]
 * Tx operation complete [3] Rx Rec ycle occurred (Sequence TR only) [4] Rx
 * operation complete (Sequence TR only) [5] TxAck operation complete(Sequence TR only)
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_CTRL_STS_SEQ_T_STATUS field. */
#define ZLL_RD_SEQ_CTRL_STS_SEQ_T_STATUS(base) ((ZLL_SEQ_CTRL_STS_REG(base) & ZLL_SEQ_CTRL_STS_SEQ_T_STATUS_MASK) >> ZLL_SEQ_CTRL_STS_SEQ_T_STATUS_SHIFT)
#define ZLL_BRD_SEQ_CTRL_STS_SEQ_T_STATUS(base) (BME_UBFX32(&ZLL_SEQ_CTRL_STS_REG(base), ZLL_SEQ_CTRL_STS_SEQ_T_STATUS_SHIFT, ZLL_SEQ_CTRL_STS_SEQ_T_STATUS_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_CTRL_STS, field SW_ABORTED[24] (RO)
 *
 * when asserted, indicates that the autosequence has terminated due to an
 * Software abort. Software can abort any programmed autosequence by writing Sequence
 * I to XCVSEQ. This bit is valid at the SEQIRQ interrupt. Hardware will maintain
 * this bit asserted until the next autosequence commences. Read-only bit.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_CTRL_STS_SW_ABORTED field. */
#define ZLL_RD_SEQ_CTRL_STS_SW_ABORTED(base) ((ZLL_SEQ_CTRL_STS_REG(base) & ZLL_SEQ_CTRL_STS_SW_ABORTED_MASK) >> ZLL_SEQ_CTRL_STS_SW_ABORTED_SHIFT)
#define ZLL_BRD_SEQ_CTRL_STS_SW_ABORTED(base) (BME_UBFX32(&ZLL_SEQ_CTRL_STS_REG(base), ZLL_SEQ_CTRL_STS_SW_ABORTED_SHIFT, ZLL_SEQ_CTRL_STS_SW_ABORTED_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_CTRL_STS, field TC3_ABORTED[25] (RO)
 *
 * when asserted, indicates that the autosequence has terminated due to an TC3
 * (TMR3) timeout during a receive operation. This bit is valid at the SEQIRQ
 * interrupt. Hardware will maintain this bit asserted until the next autosequence
 * commences. Read-only bit.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_CTRL_STS_TC3_ABORTED field. */
#define ZLL_RD_SEQ_CTRL_STS_TC3_ABORTED(base) ((ZLL_SEQ_CTRL_STS_REG(base) & ZLL_SEQ_CTRL_STS_TC3_ABORTED_MASK) >> ZLL_SEQ_CTRL_STS_TC3_ABORTED_SHIFT)
#define ZLL_BRD_SEQ_CTRL_STS_TC3_ABORTED(base) (BME_UBFX32(&ZLL_SEQ_CTRL_STS_REG(base), ZLL_SEQ_CTRL_STS_TC3_ABORTED_SHIFT, ZLL_SEQ_CTRL_STS_TC3_ABORTED_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_CTRL_STS, field PLL_ABORTED[26] (RO)
 *
 * when asserted, indicates that the autosequence has terminated due to an PLL
 * unlock event. This bit is valid at the SEQIRQ interrupt. Hardware will maintain
 * this bit asserted until the next autosequence commences. Read-only bit.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_CTRL_STS_PLL_ABORTED field. */
#define ZLL_RD_SEQ_CTRL_STS_PLL_ABORTED(base) ((ZLL_SEQ_CTRL_STS_REG(base) & ZLL_SEQ_CTRL_STS_PLL_ABORTED_MASK) >> ZLL_SEQ_CTRL_STS_PLL_ABORTED_SHIFT)
#define ZLL_BRD_SEQ_CTRL_STS_PLL_ABORTED(base) (BME_UBFX32(&ZLL_SEQ_CTRL_STS_REG(base), ZLL_SEQ_CTRL_STS_PLL_ABORTED_SHIFT, ZLL_SEQ_CTRL_STS_PLL_ABORTED_WIDTH))
/*@}*/

